print("---โปรแกรมคำนาณพื้นที่และคิดราคากระเบื้อง---")
print("1. รูปสี่เหลี่ยม")
print("2. รูปสามเหลี่ยม")
print("3. รูปวงกลม")

menu = input("เลือกเมนูที่ต้องการคำนวณ(1/2/3):")

area = 0

if menu == "1":
    print("\n[ คำนาณพื้นที่สี่เหลี่ยม ]")
    width = float(input("ใส่ความกว้าง (เมตร) : ")) 
    length = float(input("ใส่ความยาว (เมตร) : "))
    area = width * length

elif menu == "2":
    print("\n[ คำนาณพื้นที่สี่เหลี่ยม ]")
    base = float(input("ใส่ความยาวฐาน (เมตร) : ")) 
    high = float(input("ใส่ความสูง (เมตร) : "))
    area = 0.5 * base * high
    
elif menu == "3":
    print("\n[ คำนวณพื้นที่วงกลม ]")
    r = float(input("ใส่ความยาวรัศมี (เมตร): "))
    area = 3.14 * r * r  

else:
    print("\n❌ คุณเลือกเมนูไม่ถูกต้อง กรุณารันโปรแกรมใหม่อีกครั้ง")

if area > 0:
    print("---------------------------------")
    print("📐 พื้นที่ทั้งหมดคือ:", area, "ตารางเมตร")
    print("---------------------------------")

    price_per_sqm = float(
        input("ราคาค่ากระเบื้อง/ค่าช่าง (บาทต่อตารางเมตร): ")
    )
    total_price = area * price_per_sqm

    print("---------------------------------")
    print("💰 งบประมาณที่ต้องใช้ทั้งหมด:", total_price, "บาท")
    print("---------------------------------")